{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 24, "activation": "tanh", "nb_col": 5, "batch_input_shape": [null, 66, 200, 3], "b_regularizer": null, "trainable": true, "border_mode": "valid", "nb_row": 5, "input_dtype": "float32", "activity_regularizer": null, "bias": true, "b_constraint": null, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "name": "conv1", "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "activation": "tanh", "name": "conv2", "nb_col": 5, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_row": 5, "b_constraint": null, "b_regularizer": null, "bias": true, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "activation": "tanh", "name": "conv3", "nb_col": 5, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_row": 5, "b_constraint": null, "b_regularizer": null, "bias": true, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activation": "tanh", "name": "conv4", "nb_col": 3, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_row": 3, "b_constraint": null, "b_regularizer": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activation": "tanh", "name": "conv5", "nb_col": 3, "activity_regularizer": null, "trainable": true, "border_mode": "valid", "nb_row": 3, "b_constraint": null, "b_regularizer": null, "bias": true, "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "tanh", "trainable": true, "name": "hidden1", "b_regularizer": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1164}}, {"class_name": "Dense", "config": {"activation": "tanh", "trainable": true, "name": "hidden2", "b_regularizer": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 100}}, {"class_name": "Dense", "config": {"activation": "tanh", "trainable": true, "name": "hidden3", "b_regularizer": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 50}}, {"class_name": "Dense", "config": {"activation": "tanh", "trainable": true, "name": "hidden4", "b_regularizer": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 10}}, {"class_name": "Dense", "config": {"activation": "tanh", "trainable": true, "name": "output", "b_regularizer": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 1}}]}