{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "batch_input_shape": [null, 66, 200, 3], "nb_col": 5, "subsample": [2, 2], "name": "conv1", "nb_filter": 24, "W_regularizer": null, "activation": "tanh", "nb_row": 5, "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_dtype": "float32", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "nb_col": 5, "subsample": [2, 2], "name": "conv2", "nb_filter": 36, "W_regularizer": null, "activation": "tanh", "nb_row": 5, "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "nb_col": 5, "subsample": [2, 2], "name": "conv3", "nb_filter": 48, "W_regularizer": null, "activation": "tanh", "nb_row": 5, "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "name": "conv4", "nb_filter": 64, "W_regularizer": null, "activation": "tanh", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "name": "conv5", "nb_filter": 64, "W_regularizer": null, "activation": "tanh", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1164, "name": "hidden1", "input_dim": null, "W_regularizer": null, "activation": "tanh", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 100, "name": "hidden2", "input_dim": null, "W_regularizer": null, "activation": "tanh", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 50, "name": "hidden3", "input_dim": null, "W_regularizer": null, "activation": "tanh", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "name": "hidden4", "input_dim": null, "W_regularizer": null, "activation": "tanh", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "name": "output", "input_dim": null, "W_regularizer": null, "activation": "tanh", "bias": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null}}]}