{"keras_version": "1.1.1", "config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "name": "lambda_1", "output_shape_type": "raw", "input_dtype": "float32", "function_type": "lambda", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s\u00a5\u0000\u0000\u0000|\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u00018}\u0000\u0000|\u0000\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001\u001d}\u0000\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000\u0083\u0001\u0000d\u0003\u0000d\u0004\u0000\u0085\u0002\u0000\u0019\\\u0002\u0000}\u0001\u0000}\u0002\u0000d\u0005\u0000}\u0003\u0000|\u0003\u0000d\u0006\u0000\u0017}\u0004\u0000|\u0002\u0000d\u0007\u0000\u0018d\b\u0000\u001a}\u0005\u0000d\u0007\u0000|\u0005\u0000\u0017}\u0006\u0000|\u0000\u0000d\t\u0000d\t\u0000\u0085\u0002\u0000|\u0003\u0000|\u0004\u0000\u0085\u0002\u0000|\u0005\u0000|\u0006\u0000\u0085\u0002\u0000d\t\u0000d\t\u0000\u0085\u0002\u0000f\u0004\u0000\u0019S)\n\u00fa\u008dNormalize input batches to mean 0 and standard deviation 1, then crops\n                height and width to dimensions (66, 200).\n            \u00da\bkeepdimsT\u00e9\u0001\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00e9<\u0000\u0000\u0000\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000N)\u0004\u00da\u0001K\u00da\u0004mean\u00da\u0003std\u00da\tint_shape)\u0007\u00da\u0001x\u00da\u0001m\u00da\u0001n\u00da\u0001a\u00da\u0001b\u00da\u0001c\u00da\u0001d\u00a9\u0000r\u0014\u0000\u0000\u0000\u00fa\bmodel.py\u00da\tnormalize\u00ab\u0000\u0000\u0000s\u0010\u0000\u0000\u0000\u0000\u0004\u0019\u0001\u0019\u0002\u001f\u0002\u0006\u0001\n\u0001\u000e\u0001\n\u0002", null, null], "output_shape": [66, 200, 3], "trainable": true}, "class_name": "Lambda"}, {"config": {"name": "conv1", "nb_row": 5, "nb_filter": 24, "W_constraint": null, "nb_col": 5, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "tanh", "bias": true, "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "conv2", "nb_row": 5, "nb_filter": 36, "W_constraint": null, "nb_col": 5, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "tanh", "bias": true, "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "conv3", "nb_row": 5, "nb_filter": 48, "W_constraint": null, "nb_col": 5, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "tanh", "bias": true, "W_regularizer": null, "subsample": [2, 2], "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "conv4", "nb_row": 3, "nb_filter": 64, "W_constraint": null, "nb_col": 3, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "tanh", "bias": true, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "conv5", "nb_row": 3, "nb_filter": 64, "W_constraint": null, "nb_col": 3, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "tanh", "bias": true, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "hidden1", "input_dim": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "tanh", "bias": true, "W_constraint": null, "b_regularizer": null, "output_dim": 1164, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "hidden2", "input_dim": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "tanh", "bias": true, "W_constraint": null, "b_regularizer": null, "output_dim": 100, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "hidden3", "input_dim": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "tanh", "bias": true, "W_constraint": null, "b_regularizer": null, "output_dim": 50, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "hidden4", "input_dim": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "tanh", "bias": true, "W_constraint": null, "b_regularizer": null, "output_dim": 10, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "output", "input_dim": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "tanh", "bias": true, "W_constraint": null, "b_regularizer": null, "output_dim": 1, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}