{"config": [{"config": {"input_dtype": "float32", "subsample": [2, 2], "b_constraint": null, "border_mode": "valid", "activation": "relu", "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "init": "glorot_uniform", "W_regularizer": null, "name": "conv1", "nb_col": 5, "trainable": true, "dim_ordering": "tf", "bias": true, "W_constraint": null, "nb_filter": 24, "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "b_constraint": null, "border_mode": "valid", "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "conv2", "nb_col": 5, "trainable": true, "dim_ordering": "tf", "bias": true, "W_constraint": null, "nb_filter": 36, "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "b_constraint": null, "border_mode": "valid", "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "conv3", "nb_col": 5, "trainable": true, "dim_ordering": "tf", "bias": true, "W_constraint": null, "nb_filter": 48, "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "b_constraint": null, "border_mode": "valid", "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "conv4", "nb_col": 3, "trainable": true, "dim_ordering": "tf", "bias": true, "W_constraint": null, "nb_filter": 64, "nb_row": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "b_constraint": null, "border_mode": "valid", "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "conv5", "nb_col": 3, "trainable": true, "dim_ordering": "tf", "bias": true, "W_constraint": null, "nb_filter": 64, "nb_row": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "b_constraint": null, "activation": "relu", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "name": "hidden", "output_dim": 1164, "trainable": true, "bias": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "b_constraint": null, "activation": "softmax", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "name": "output", "output_dim": 21, "trainable": true, "bias": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"output_shape": [1], "name": "lambda_1", "arguments": {}, "trainable": true, "output_shape_type": "raw", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0013\u0000\u0000\u0000s1\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000\u0083\u0001\u0000d\u0001\u0000\u0083\u0002\u0000\u0088\u0000\u0000\u001bd\u0002\u0000\u0018\u0088\u0001\u0000\u000b\u0088\u0001\u0000\u0083\u0003\u0000S)\u0003N\u00da\u0007float32\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0004\u00da\u0001K\u00da\u0004clip\u00da\u0004cast\u00da\u0006argmax)\u0001\u00da\u0001x)\u0002\u00da\fhalf_breadth\u00da\u0005reach\u00a9\u0000\u00fa\bmodel.py\u00da\b<lambda>'\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, [10, 0.5]]}, "class_name": "Lambda"}], "class_name": "Sequential", "keras_version": "1.1.1"}