{"config": [{"config": {"trainable": true, "bias": true, "activation": "relu", "input_dtype": "float32", "b_constraint": null, "activity_regularizer": null, "nb_filter": 24, "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_6", "nb_row": 5, "batch_input_shape": [null, 66, 200, 3], "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "bias": true, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_filter": 36, "dim_ordering": "tf", "nb_col": 5, "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_7", "nb_row": 5, "W_constraint": null, "subsample": [2, 2], "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "bias": true, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_filter": 48, "dim_ordering": "tf", "nb_col": 5, "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_8", "nb_row": 5, "W_constraint": null, "subsample": [2, 2], "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "bias": true, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "nb_col": 3, "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_9", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "bias": true, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "nb_col": 3, "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_10", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"output_dim": 1164, "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null, "activation": "relu", "W_regularizer": null, "W_constraint": null, "name": "hidden1", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"output_dim": 21, "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null, "activation": "softmax", "W_regularizer": null, "W_constraint": null, "name": "output", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"arguments": {}, "trainable": true, "output_shape_type": "raw", "output_shape": [1], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0013\u0000\u0000\u0000s-\u0000\u0000\u0000d\u0001\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000\u0083\u0001\u0000d\u0002\u0000\u0083\u0002\u0000\u0088\u0000\u0000d\u0003\u0000\u0018\u001bd\u0004\u0000\u0018\u0014\u0088\u0001\u0000\u0014S)\u0005N\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000@\u00da\u0007float32\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0003\u00da\u0001K\u00da\u0004cast\u00da\u0006argmax)\u0001\u00da\u0001x)\u0002\u00da\u0007breadth\u00da\u0005reach\u00a9\u0000\u00fa\bmodel.py\u00da\b<lambda>*\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, [21, 1.0]], "name": "lambda_1", "function_type": "lambda"}, "class_name": "Lambda"}], "keras_version": "1.1.1", "class_name": "Sequential"}