{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s\u00a5\u0000\u0000\u0000|\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u00018}\u0000\u0000|\u0000\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001\u001d}\u0000\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000\u0083\u0001\u0000d\u0003\u0000d\u0004\u0000\u0085\u0002\u0000\u0019\\\u0002\u0000}\u0001\u0000}\u0002\u0000d\u0005\u0000}\u0003\u0000|\u0003\u0000d\u0006\u0000\u0017}\u0004\u0000|\u0002\u0000d\u0007\u0000\u0018d\b\u0000\u001a}\u0005\u0000d\u0007\u0000|\u0005\u0000\u0017}\u0006\u0000|\u0000\u0000d\t\u0000d\t\u0000\u0085\u0002\u0000|\u0003\u0000|\u0004\u0000\u0085\u0002\u0000|\u0005\u0000|\u0006\u0000\u0085\u0002\u0000d\t\u0000d\t\u0000\u0085\u0002\u0000f\u0004\u0000\u0019S)\n\u00fa\u008dNormalize input batches to mean 0 and standard deviation 1, then crops\n                height and width to dimensions (66, 200).\n            \u00da\bkeepdimsT\u00e9\u0001\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00e9<\u0000\u0000\u0000\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000N)\u0004\u00da\u0001K\u00da\u0004mean\u00da\u0003std\u00da\tint_shape)\u0007\u00da\u0001x\u00da\u0001m\u00da\u0001n\u00da\u0001a\u00da\u0001b\u00da\u0001c\u00da\u0001d\u00a9\u0000r\u0014\u0000\u0000\u0000\u00fa\bmodel.py\u00da\tnormalize\u00ab\u0000\u0000\u0000s\u0010\u0000\u0000\u0000\u0000!\u0019\u0001\u0019\u0002\u001f\u0002\u0006\u0001\n\u0001\u000e\u0001\n\u0002", null, null], "arguments": {}, "batch_input_shape": [null, 160, 320, 3], "output_shape": [66, 200, 3], "function_type": "lambda", "input_dtype": "float32", "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "b_regularizer": null, "init": "glorot_uniform", "name": "conv1", "nb_filter": 24, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "dim_ordering": "tf", "bias": true, "b_constraint": null, "W_constraint": null, "activation": "relu", "W_regularizer": null, "nb_row": 5, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "b_regularizer": null, "init": "glorot_uniform", "name": "conv2", "nb_filter": 36, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "dim_ordering": "tf", "bias": true, "b_constraint": null, "W_constraint": null, "activation": "relu", "W_regularizer": null, "nb_row": 5, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "b_regularizer": null, "init": "glorot_uniform", "name": "conv3", "nb_filter": 48, "activity_regularizer": null, "subsample": [2, 2], "trainable": true, "dim_ordering": "tf", "bias": true, "b_constraint": null, "W_constraint": null, "activation": "relu", "W_regularizer": null, "nb_row": 5, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "b_regularizer": null, "init": "glorot_uniform", "name": "conv4", "nb_filter": 64, "activity_regularizer": null, "subsample": [1, 1], "trainable": true, "dim_ordering": "tf", "bias": true, "b_constraint": null, "W_constraint": null, "activation": "relu", "W_regularizer": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "b_regularizer": null, "init": "glorot_uniform", "name": "conv5", "nb_filter": 64, "activity_regularizer": null, "subsample": [1, 1], "trainable": true, "dim_ordering": "tf", "bias": true, "b_constraint": null, "W_constraint": null, "activation": "relu", "W_regularizer": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "output_dim": 1164, "name": "hidden", "b_constraint": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "relu", "W_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "output_dim": 21, "name": "outputs", "b_constraint": null, "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "softmax", "W_regularizer": null}}, {"class_name": "Lambda", "config": {"output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0013\u0000\u0000\u0000s1\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000\u0083\u0001\u0000d\u0001\u0000\u0083\u0002\u0000\u0088\u0000\u0000\u001bd\u0002\u0000\u0018\u0088\u0001\u0000\u000b\u0088\u0001\u0000\u0083\u0003\u0000S)\u0003N\u00da\u0007float32\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0004\u00da\u0001K\u00da\u0004clip\u00da\u0004cast\u00da\u0006argmax)\u0001\u00da\u0001x)\u0002\u00da\fhalf_breadth\u00da\u0005reach\u00a9\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0004\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, [10, 0.5]], "arguments": {}, "output_shape": [1], "function_type": "lambda", "name": "lambda_2"}}]}