{"keras_version": "1.1.1", "config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "output_shape": [66, 200, 3], "name": "lambda_1", "input_dtype": "float32", "output_shape_type": "raw", "function_type": "lambda", "arguments": {}, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s\u00ab\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000d\u0001\u0000d\u0002\u0000\u0085\u0002\u0000\u0019\\\u0002\u0000}\u0001\u0000}\u0002\u0000d\u0003\u0000}\u0003\u0000|\u0003\u0000d\u0004\u0000\u0017}\u0004\u0000|\u0002\u0000d\u0005\u0000\u0018d\u0006\u0000\u001a}\u0005\u0000d\u0005\u0000|\u0005\u0000\u0017}\u0006\u0000|\u0000\u0000d\u0007\u0000d\u0007\u0000\u0085\u0002\u0000|\u0003\u0000|\u0004\u0000\u0085\u0002\u0000|\u0005\u0000|\u0006\u0000\u0085\u0002\u0000d\u0007\u0000d\u0007\u0000\u0085\u0002\u0000f\u0004\u0000\u0019}\u0000\u0000|\u0000\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000d\b\u0000d\t\u0000\u0083\u0001\u00018}\u0000\u0000|\u0000\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000d\b\u0000d\t\u0000\u0083\u0001\u0001\u001d}\u0000\u0000|\u0000\u0000S)\n\u00fa\u0086Crops height and width to dimensions (66, 200), then normalize values to\n                mean 0 and standard deviation 1.\n            \u00e9\u0001\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00e9<\u0000\u0000\u0000\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000N\u00da\bkeepdimsT)\u0004\u00da\u0001K\u00da\tint_shape\u00da\u0004mean\u00da\u0003std)\u0007\u00da\u0001x\u00da\u0001m\u00da\u0001n\u00da\u0001a\u00da\u0001b\u00da\u0001c\u00da\u0001d\u00a9\u0000r\u0014\u0000\u0000\u0000\u00fa\bmodel.py\u00da\tnormalize\u000f\u0001\u0000\u0000s\u0012\u0000\u0000\u0000\u0000\u0004\u001f\u0002\u0006\u0001\n\u0001\u000e\u0001\n\u0002.\u0001\u0019\u0001\u0019\u0002", null, null]}, "class_name": "Lambda"}, {"config": {"b_constraint": null, "W_regularizer": null, "name": "conv1", "nb_filter": 24, "nb_row": 5, "trainable": true, "activation": "relu", "init": "glorot_uniform", "nb_col": 5, "dim_ordering": "tf", "subsample": [2, 2], "bias": true, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "W_regularizer": null, "name": "conv2", "nb_filter": 36, "nb_row": 5, "trainable": true, "activation": "relu", "init": "glorot_uniform", "nb_col": 5, "dim_ordering": "tf", "subsample": [2, 2], "bias": true, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "W_regularizer": null, "name": "conv3", "nb_filter": 48, "nb_row": 5, "trainable": true, "activation": "relu", "init": "glorot_uniform", "nb_col": 5, "dim_ordering": "tf", "subsample": [2, 2], "bias": true, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "W_regularizer": null, "name": "conv4", "nb_filter": 64, "nb_row": 3, "trainable": true, "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "W_regularizer": null, "name": "conv5", "nb_filter": 64, "nb_row": 3, "trainable": true, "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 1164, "b_constraint": null, "name": "hidden", "bias": true, "trainable": true, "activation": "relu", "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 21, "b_constraint": null, "name": "outputs", "bias": true, "trainable": true, "activation": "softmax", "init": "glorot_uniform", "input_dim": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"output_shape": [1], "name": "lambda_2", "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0013\u0000\u0000\u0000s1\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000\u0083\u0001\u0000d\u0001\u0000\u0083\u0002\u0000\u0088\u0000\u0000\u001bd\u0002\u0000\u0018\u0088\u0001\u0000\u000b\u0088\u0001\u0000\u0083\u0003\u0000S)\u0003N\u00da\u0007float32\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0004\u00da\u0001K\u00da\u0004clip\u00da\u0004cast\u00da\u0006argmax)\u0001\u00da\u0001x)\u0002\u00da\fhalf_breadth\u00da\u0005reach\u00a9\u0000\u00fa\bmodel.py\u00da\b<lambda>t\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, [10, 0.5]]}, "class_name": "Lambda"}], "class_name": "Sequential"}