{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "name": "conv1", "b_regularizer": null, "nb_filter": 24, "W_constraint": null, "W_regularizer": null, "bias": true, "batch_input_shape": [null, 66, 200, 3], "activation": "relu", "nb_col": 5, "subsample": [2, 2], "b_constraint": null, "dim_ordering": "tf", "input_dtype": "float32", "init": "glorot_uniform", "nb_row": 5, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "trainable": true, "name": "conv2", "b_regularizer": null, "nb_filter": 36, "W_constraint": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "bias": true, "nb_col": 5, "subsample": [2, 2], "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "trainable": true, "name": "conv3", "b_regularizer": null, "nb_filter": 48, "W_constraint": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "bias": true, "nb_col": 5, "subsample": [2, 2], "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "trainable": true, "name": "conv4", "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "bias": true, "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "trainable": true, "name": "conv5", "b_regularizer": null, "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "activation": "relu", "border_mode": "valid", "bias": true, "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "output_dim": 1164, "activity_regularizer": null, "input_dim": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "init": "glorot_uniform", "name": "hidden"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "output_dim": 21, "activity_regularizer": null, "input_dim": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activation": "softmax", "bias": true, "init": "glorot_uniform", "name": "output"}}, {"class_name": "Lambda", "config": {"trainable": true, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0013\u0000\u0000\u0000s!\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000\u0083\u0001\u0000d\u0001\u0000\u0083\u0002\u0000\u0088\u0000\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00da\u0007float32\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0003\u00da\u0001K\u00da\u0004cast\u00da\u0006argmax)\u0001\u00da\u0001x)\u0001\u00da\fhalf_breadth\u00a9\u0000\u00fa\bmodel.py\u00da\b<lambda>'\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, [10]], "output_shape_type": "raw", "function_type": "lambda", "output_shape": [1], "arguments": {}}}]}