{"config": [{"config": {"border_mode": "valid", "dim_ordering": "tf", "input_dtype": "float32", "pool_size": [2, 2], "name": "maxpooling2d_3", "batch_input_shape": [null, 70, 320, 1], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_filter": 32, "nb_row": 5, "border_mode": "valid", "trainable": true, "batch_input_shape": [null, 70, 320, 1], "name": "convolution2d_3", "activation": "relu", "W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_4", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_filter": 32, "border_mode": "valid", "trainable": true, "name": "convolution2d_4", "nb_row": 5, "nb_col": 5, "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": null, "output_dim": 49, "trainable": true, "name": "hidden1", "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "input_dim": null, "output_dim": 21, "trainable": true, "name": "output", "activation": "softmax", "W_regularizer": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0013\u0000\u0000\u0000s-\u0000\u0000\u0000d\u0001\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000\u0083\u0001\u0000d\u0002\u0000\u0083\u0002\u0000\u0088\u0000\u0000d\u0003\u0000\u0018\u001bd\u0004\u0000\u0018\u0014\u0088\u0001\u0000\u0014S)\u0005N\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000@\u00da\u0007float32\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0003\u00da\u0001K\u00da\u0004cast\u00da\u0006argmax)\u0001\u00da\u0001x)\u0002\u00da\u0007breadth\u00da\u0005reach\u00a9\u0000\u00fa\bmodel.py\u00da\b<lambda>z\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, [21, 1.0]], "output_shape": [1], "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "arguments": {}, "trainable": true}, "class_name": "Lambda"}], "keras_version": "1.1.1", "class_name": "Sequential"}