{"config": [{"config": {"input_dtype": "float32", "output_shape_type": "raw", "trainable": true, "function_type": "lambda", "name": "lambda_1", "arguments": {}, "output_shape": [66, 200, 3], "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s\u00ab\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000d\u0001\u0000d\u0002\u0000\u0085\u0002\u0000\u0019\\\u0002\u0000}\u0001\u0000}\u0002\u0000d\u0003\u0000}\u0003\u0000|\u0003\u0000d\u0004\u0000\u0017}\u0004\u0000|\u0002\u0000d\u0005\u0000\u0018d\u0006\u0000\u001a}\u0005\u0000d\u0005\u0000|\u0005\u0000\u0017}\u0006\u0000|\u0000\u0000d\u0007\u0000d\u0007\u0000\u0085\u0002\u0000|\u0003\u0000|\u0004\u0000\u0085\u0002\u0000|\u0005\u0000|\u0006\u0000\u0085\u0002\u0000d\u0007\u0000d\u0007\u0000\u0085\u0002\u0000f\u0004\u0000\u0019}\u0000\u0000|\u0000\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000d\b\u0000d\t\u0000\u0083\u0001\u00018}\u0000\u0000|\u0000\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000d\b\u0000d\t\u0000\u0083\u0001\u0001\u001d}\u0000\u0000|\u0000\u0000S)\n\u00fa\u008dNormalize input batches to mean 0 and standard deviation 1, then crops\n                height and width to dimensions (66, 200).\n            \u00e9\u0001\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00e9<\u0000\u0000\u0000\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000N\u00da\bkeepdimsT)\u0004\u00da\u0001K\u00da\tint_shape\u00da\u0004mean\u00da\u0003std)\u0007\u00da\u0001x\u00da\u0001m\u00da\u0001n\u00da\u0001a\u00da\u0001b\u00da\u0001c\u00da\u0001d\u00a9\u0000r\u0014\u0000\u0000\u0000\u00fa\bmodel.py\u00da\tnormalize\u00aa\u0000\u0000\u0000s\u0012\u0000\u0000\u0000\u0000\u0004\u001f\u0002\u0006\u0001\n\u0001\u000e\u0001\n\u0002.\u0001\u0019\u0001\u0019\u0002", null, null]}, "class_name": "Lambda"}, {"config": {"nb_row": 5, "border_mode": "valid", "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "b_regularizer": null, "subsample": [2, 2], "activation": "tanh", "W_regularizer": null, "nb_filter": 24, "W_constraint": null, "activity_regularizer": null, "name": "conv1", "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 5, "border_mode": "valid", "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "b_regularizer": null, "subsample": [2, 2], "activation": "tanh", "W_regularizer": null, "nb_filter": 36, "W_constraint": null, "activity_regularizer": null, "name": "conv2", "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 5, "border_mode": "valid", "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "b_regularizer": null, "subsample": [2, 2], "activation": "tanh", "W_regularizer": null, "nb_filter": 48, "W_constraint": null, "activity_regularizer": null, "name": "conv3", "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "border_mode": "valid", "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "b_regularizer": null, "subsample": [1, 1], "activation": "tanh", "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "activity_regularizer": null, "name": "conv4", "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "border_mode": "valid", "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "b_regularizer": null, "subsample": [1, 1], "activation": "tanh", "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "activity_regularizer": null, "name": "conv5", "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "output_dim": 1164, "trainable": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "tanh", "activity_regularizer": null, "W_constraint": null, "bias": true, "name": "hidden1"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "output_dim": 100, "trainable": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "tanh", "activity_regularizer": null, "W_constraint": null, "bias": true, "name": "hidden2"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "output_dim": 50, "trainable": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "tanh", "activity_regularizer": null, "W_constraint": null, "bias": true, "name": "hidden3"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "output_dim": 10, "trainable": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "tanh", "activity_regularizer": null, "W_constraint": null, "bias": true, "name": "hidden4"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "output_dim": 1, "trainable": true, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "tanh", "activity_regularizer": null, "W_constraint": null, "bias": true, "name": "output"}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}