{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "MaxPooling2D", "config": {"input_dtype": "float32", "name": "maxpooling2d_3", "strides": [2, 2], "batch_input_shape": [null, 160, 320, 1], "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_3", "nb_filter": 32, "nb_row": 5, "border_mode": "valid", "bias": true, "trainable": true, "input_dtype": "float32", "W_constraint": null, "batch_input_shape": [null, 160, 320, 1], "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "relu", "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_4", "nb_filter": 32, "border_mode": "valid", "bias": true, "trainable": true, "W_constraint": null, "nb_row": 5, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "relu", "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"name": "hidden1", "W_regularizer": null, "activation": "relu", "bias": true, "input_dim": null, "output_dim": 49, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "output", "W_regularizer": null, "activation": "softmax", "bias": true, "input_dim": null, "output_dim": 7, "W_constraint": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null}}, {"class_name": "Lambda", "config": {"arguments": {}, "name": "lambda_1", "output_shape": [1], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0013\u0000\u0000\u0000s-\u0000\u0000\u0000d\u0001\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000\u0083\u0001\u0000d\u0002\u0000\u0083\u0002\u0000\u0088\u0000\u0000d\u0003\u0000\u0018\u001bd\u0004\u0000\u0018\u0014\u0088\u0001\u0000\u0014S)\u0005N\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000@\u00da\u0007float32\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0003\u00da\u0001K\u00da\u0004cast\u00da\u0006argmax)\u0001\u00da\u0001x)\u0002\u00da\u0007breadth\u00da\u0005reach\u00a9\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0089\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, [7, 1.0]], "trainable": true, "function_type": "lambda"}}]}