{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "MaxPooling2D", "config": {"batch_input_shape": [null, 70, 320, 1], "input_dtype": "float32", "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activation": "relu", "nb_row": 5, "input_dtype": "float32", "border_mode": "valid", "trainable": true, "bias": true, "activity_regularizer": null, "batch_input_shape": [null, 70, 320, 1], "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 32, "subsample": [1, 1], "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_3"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "name": "maxpooling2d_4", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activation": "relu", "nb_row": 5, "border_mode": "valid", "trainable": true, "bias": true, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 32, "subsample": [1, 1], "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"activation": "relu", "output_dim": 49, "trainable": true, "bias": true, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "hidden1"}}, {"class_name": "Dense", "config": {"activation": "softmax", "output_dim": 11, "trainable": true, "bias": true, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "output"}}, {"class_name": "Lambda", "config": {"output_shape": [1], "name": "lambda_1", "output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0013\u0000\u0000\u0000s-\u0000\u0000\u0000d\u0001\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000\u0083\u0001\u0000d\u0002\u0000\u0083\u0002\u0000\u0088\u0000\u0000d\u0003\u0000\u0018\u001bd\u0004\u0000\u0018\u0014\u0088\u0001\u0000\u0014S)\u0005N\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000@\u00da\u0007float32\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0003\u00da\u0001K\u00da\u0004cast\u00da\u0006argmax)\u0001\u00da\u0001x)\u0002\u00da\u0007breadth\u00da\u0005reach\u00a9\u0000\u00fa\bmodel.py\u00da\b<lambda>w\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, [11, 1.2]], "arguments": {}, "function_type": "lambda"}}]}